{
    "themachine_1 name": "Hecklers",
    "themachine_1 description": "I just arrived, and these Scavs, or as I like to call them, Hecklers, are causing trouble for me in Customs. If it isn't too much to ask, since I just got here and all, would you mind going and dealing with them for me? I haven't even unpacked my things yet. Not to worry, I'll make it worth your while.",
    "themachine_1 successMessageText": "Well, that didn't take you long. You must be the eliminator around these parts. Anyway, I told you I would make it worth your while, so here you go. I may call on you again for some tasks in the future.",
    "themachine_1 AFF_0": "Eliminate 10 Hecklers in Customs",
    "themachine_2 name": "I Need A Drink...",
    "themachine_2 description": "After dealing with those Hecklers, I could use a drink. It seems I'm going to be here for a while, so I'd better make the most of it. Do you happen to know where I can get some liquor around here? How about you go see if you can find me these items, and we can have a drink or ten, lol. What do you say, can you help me out?",
    "themachine_2 successMessageText": "HELL YEAH! Now we're talking. This should keep me going for a few days. How about we have that drink now? Oh yeah, here, these are for all your troubles. Thanks again.",
    "themachine_2 location": "any",
    "themachine_2 AFF_1": "Find and hand over Vodka",
    "themachine_2 AFF_2": "Find and hand over Whiskey",
    "themachine_2 AFF_3": "Find and hand over Beers",
    "themachine_2 AFF_4": "Find and hand over Moonshine",
    "themachine_3 name": "Mall of Duty",
    "themachine_3 description": "Time for you to take out some more Hecklers. It looks like this time they are wreaking havoc on Interchange. I need you to go and deal with them for me. I'm too busy dealing with these Hecklers on Customs. I will, as always, make it worth your while, of course.",
    "themachine_3 successMessageText": "Thanks. Maybe this time they will back off, so my people can gather the things needed to keep things going around here.",
    "themachine_3 AFF_0": "Eliminate 15 Hecklers on Interchange",
    "themachine_4 name": "OH YEAH!",
    "themachine_4 description": "Man, all this Heckler hunting got me thirsty as hell! I have some Kool Aid packets I brought with me, but I don't have any sugar or enough water to make a pitcher of this amazing goodness. While you are out doing your thing out there, do me a solid and grab any extra sugar and waters you come across. I will hook you up with some sweet gear for doing so.",
    "themachine_4 successMessageText": "Awe man, you are the greatest! I am going to make a pitcher right now! But first, here man, you deserve this for sure.",
    "themachine_4 AFF_0": "Find and hand over Pack of sugar",
    "themachine_4 AFF_1": "Find and hand over Bottle of water (0.6L)",
    "themachine_5 name": "They're in the WOOOODS",
    "themachine_5 description": "Man, those damn Hecklers are everywhere, huh? I have a task for you if you want it. I've been hearing around Tarkov that these Hecklers have been living in the woods. They've set up a base of operations there, and I need you to go take down some of their numbers. The reward for your good deeds will be well worth your efforts.",
    "themachine_5 successMessageText": "That should help us keep their numbers down for a while, but they will replace those numbers fast. Anyway, here are the rewards I was speaking of. I hope they can do you some good out there.",
    "themachine_5 AFF_0": "Eliminate 10 Hecklers in Woods",
    "themachine_6 name": "PODCAST",
    "themachine_6 description": "It's been a while since I've got to host my PODCAST. I need some equipment so I can start the show from here. I need you to go out and find me these items and return them to me. I have something here I am sure you will love in return for your time.",
    "themachine_6 successMessageText": "Great! Now I can set up everything and get casting again. Here, you deserve this.",
    "themachine_6 AFF_0": "Find and hand over PC CPU",
    "themachine_6 AFF_1": "Find and hand over CPU fan",
    "themachine_6 AFF_2": "Find and hand over RAM",
    "themachine_6 AFF_3": "Find and hand over SSD",
    "themachine_6 AFF_4": "Find and hand over Electronic components",
    "themachine_6 AFF_5": "Find and hand over Graphics card",
    "themachine_6 AFF_6": "Find and hand over OPSMEN Earmor M32 headset",
    "themachine_7 name": "Hecklers Revenge",
    "themachine_7 description": "Seems these Hecklers are at it again on Customs. My guys said it's gotten so bad they can't even gain access to the area. I'm going to need you to go out there and clear out these troublemakers for me. I trust you will get the job done where my men have failed. Now head out and finish this. I'll have your reward waiting for you when you return.",
    "themachine_7 successMessageText": "Now, see men, that's how you handle that. Here, these are for you. I know they won't go to waste like they would if I gave them to my guys, lol.",
    "themachine_7 AFF_0": "Eliminate 30 Hecklers in Customs",
    "themachine_8 name": "Bum a Smoke?",
    "themachine_8 description": "Since I am going to be here for a long time, it seems I am going to need some smokes. Also, some lighters to light said smokes. I'm going to need you to go out and find these for me. I know it seems like a pain in the ass task, but the reward will make it worth it, trust me.",
    "themachine_8 successMessageText": "Thanks, I needed a smoke too just ran out. Here, for your troubles.",
    "themachine_8 AFF_0": "Find and hand over Marlboro Cigarettes",
    "themachine_8 AFF_1": "Find and hand over Winston cigarettes",
    "themachine_8 AFF_2": "Find and hand over Strike Cigarettes",
    "themachine_8 AFF_3": "Find and hand over Apollo Soyuz cigarettes",
    "themachine_8 AFF_4": "Find and hand over Zibbo lighter",
    "themachine_8 AFF_5": "Find and hand over Cricket lighter",
    "themachine_8 AFF_6": "Find and hand over SurvL Survivor Lighter",
    "themachine_9 name": "Trash Talk",
    "themachine_9 description": "Dude, have you encountered any of these Bear Characters? Those Mother F'ers like talking trash, huh? I heard they've been seen around Factory looking for Tagilla. I think it's the perfect place to catch some of those jerks slipping. I want you to go and show those SOBs The Machine ain't no pushover. Don't worry; I got you for your services.",
    "themachine_9 successMessageText": "Heck yeah, dude! That's why I hired you for the job. That should shut those jerks up. I ain't nobody to mess with. Oh, here, like always, a pleasure doing business with you.",
    "themachine_9 AFF_0": "Eliminate 12 Bears in Factory",
    "themachine_9 AFF_1": "Handover 12 Bear Dogtags as proof",
    "themachine_10 name": "Supply Run",
    "themachine_10 description": "Hey, I need some supplies, and I'm too tied up to get them myself. Could you do a quick supply run for me? It won't take long, and I'll make sure you're rewarded handsomely for your efforts.",
    "themachine_10 successMessageText": "Thanks for the help! These supplies will be invaluable. Here's your well-deserved reward.",
    "themachine_10 AFF_0": "Find and hand over 5 Sets of files 'Master'",
    "themachine_10 AFF_1": "Find and hand over 3 Electric drills",
    "themachine_10 AFF_2": "Find and hand over 2 Toolsets",
    "themachine_10 AFF_3": "Find and hand over 3 #FireKlean gun lube",
    "themachine_10 AFF_4": "Find and hand over 1 Fierce Blow sledgehammer",
    "themachine_10 AFF_5": "Find and hand over 4 Pipe grip wrench",
    "themachine_10 AFF_6": "Find and hand over 2 Ratchet wrench",
    "themachine_11 name": "Dangerous Waters",
    "themachine_11 description": "I've received reports of troublemakers causing havoc on Shoreline. I need someone to eliminate them and restore peace. Think you're up for the challenge? I'll make it worth your while.",
    "themachine_11 successMessageText": "Excellent work! Shoreline should be safer now. Here's your reward as promised.",
    "themachine_11 AFF_0": "Eliminate 10 targets on Shoreline",
    "themachine_12 name": "Urban Warfare",
    "themachine_12 description": "The streets are overrun with troublemakers, and we need someone to clean house. Are you up for the challenge? I'll make sure you're rewarded generously.",
    "themachine_12 successMessageText": "Impressive job! The streets are safer thanks to your efforts. Here's your well-earned reward.",
    "themachine_12 AFF_0": "Eliminate 25 targets on Streets",
    "themachine_13 name": "Makin' Groceries",
    "themachine_13 description": "We're in need of specific groceries, but they're scarce. Can you help gather them? Your assistance will be greatly appreciated, and I'll ensure you're compensated for your efforts.",
    "themachine_13 successMessageText": "Well done! Your resourcefulness will greatly aid our endeavors. Here's your reward for completing the task.",
    "themachine_13 AFF_0": "Find and hand over 6 Packs of apple juice",
    "themachine_13 AFF_1": "Find and hand over 6 Packs of Grand juice",
    "themachine_13 AFF_2": "Find and hand over 6 Packs of Vita juice",
    "themachine_13 AFF_3": "Find and hand over 6 Packs of instant noodles",
    "themachine_13 AFF_4": "Find and hand over 4 Cans of green peas",
    "themachine_13 AFF_5": "Find and hand over 4 Cans of squash spread",
    "themachine_13 AFF_6": "Find and hand over 3 Packs of oat flakes",
    "themachine_13 AFF_7": "Find and hand over 4 Cans of beef stew (Large)",
    "themachine_13 AFF_8": "Find and hand over 2 Salty Dog beef sausages",
    "themachine_13 AFF_9": "Find and hand over 2 Army crackers",
    "themachine_14 name": "Guard Duty",
    "themachine_14 description": "I need someone to ensure the safety of our operations in Customs. Can you survive and protect the area? Your bravery won't go unrewarded.",
    "themachine_14 successMessageText": "You've successfully completed your guard duty, ensuring the security of our operations. Here's your well-deserved reward.",
    "themachine_14 AFF_0": "Survive and Extract from Customs",
    "themachine_15 name": "New Filming Location",
    "themachine_15 description": "Prapor mentioned there is a green screen studio that isn't being used anymore somewhere in Customs. I need you to locate it and report back to me. Don't worry, I will make it worth your time.",
    "themachine_15 successMessageText": "So that's where it is... I knew you would find it. Here, you earned this.",
    "themachine_15 AFF_0": "Locate the green screen studio in Customs"
}